Tekla.Structures.Drawing.ReinforcementPulloutElement
The ReinforcementPulloutElement class illustrates the shape and dimensions of a reinforcing bar in a drawing.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Font
Gets or sets the font of the dimension.

Tekla.Structures.Drawing.ReinforcementPulloutElement.AutomaticScaling
Gets or sets a value indicating whether the pull-out is scaled automatically or to a specified value.

Tekla.Structures.Drawing.ReinforcementPulloutElement.ScaleX
Gets or sets the scaling of the pull-out in the X direction.

Tekla.Structures.Drawing.ReinforcementPulloutElement.ScaleY
Gets or sets the scaling of the pull-out in the Y direction.

Tekla.Structures.Drawing.ReinforcementPulloutElement.RotationAxis
Gets or sets the rotation of the pull-out.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Exaggeration
Gets or sets a value indicating whether the pull-out is exaggerated.

Tekla.Structures.Drawing.ReinforcementPulloutElement.BendingRadius
Gets or sets a value indicating whether to show the pull-out bending radii.

Tekla.Structures.Drawing.ReinforcementPulloutElement.BendingAngle
Gets or sets a value indicating whether to show the pull-out bending angles.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Dimensioning
Gets or sets a value indicating whether to show the pull-out dimensions.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbolType
Gets or sets the type of the ending marks.

Tekla.Structures.Drawing.ReinforcementPulloutElement.CouplersEndAnchorSymbols
Gets or sets a value indicating whether to show coupler/anchor symbols or not.

Tekla.Structures.Drawing.ReinforcementPulloutElement.CouplersScale
Gets or sets the scale of coupler/anchor symbols.

Tekla.Structures.Drawing.ReinforcementPulloutElement.#ctor
Creates a new reinforcement pull-out element instance.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.ReinforcementPulloutElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReinforcementPulloutElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.